<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"><html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>Main</title><link href="ocean.css" rel="stylesheet" type="text/css" title="Ocean" /><script src="haddock-util.js" type="text/javascript"></script><script type="text/javascript">//<![CDATA[
window.onload = function () {pageLoad();setSynopsis("mini_Main.html");};
//]]>
</script></head><body><div id="package-header"><ul class="links" id="page-menu"><li><a href="index.html">Contents</a></li><li><a href="doc-index.html">Index</a></li></ul><p class="caption empty">&nbsp;</p></div><div id="content"><div id="module-header"><table class="info"><tr><th>Safe Haskell</th><td>Safe</td></tr></table><p class="caption">Main</p></div><div id="description"><p class="caption">Description</p><div class="doc"><p>Descrption: fun&#231;&#245;es que permitem o movimento dos jogadores no mapa
 Copyright: Ana Ribeiro
            J&#233;ssica Lemos </p></div></div><div id="synopsis"><p id="control.syn" class="caption expander" onclick="toggleSection('syn')">Synopsis</p><ul id="section.syn" class="hide" onclick="toggleSection('syn')"><li class="src short"><a href="#v:move">move</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:veJogador">veJogador</a> :: [String] -&gt; Int -&gt; Char -&gt; Bool</li><li class="src short"><a href="#v:infJogador">infJogador</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:dim">dim</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</li><li class="src short"><a href="#v:coorJogNum">coorJogNum</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</li><li class="src short"><a href="#v:pPonto">pPonto</a> :: [String] -&gt; Int -&gt; Char -&gt; Char</li><li class="src short"><a href="#v:preveMov">preveMov</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</li><li class="src short"><a href="#v:coorNumJog">coorNumJog</a> :: [String] -&gt; Int -&gt; Char -&gt; [Char]</li><li class="src short"><a href="#v:mapaMove">mapaMove</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:coordNumPUB">coordNumPUB</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:coordNumPUF">coordNumPUF</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:coordNumPowerUpB">coordNumPowerUpB</a> :: [String] -&gt; Int -&gt; Char -&gt; [Int]</li><li class="src short"><a href="#v:coordNumPowerUpF">coordNumPowerUpF</a> :: [String] -&gt; Int -&gt; Char -&gt; [Int]</li><li class="src short"><a href="#v:mapaSPUb">mapaSPUb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:mapaSPUf">mapaSPUf</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:existPU">existPU</a> :: [String] -&gt; Int -&gt; Char -&gt; Bool</li><li class="src short"><a href="#v:existBomb">existBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; Bool</li><li class="src short"><a href="#v:infBomb">infBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:infNovaBomb">infNovaBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:mapaMoveB">mapaMoveB</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:posBomb">posBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:coorBombNum">coorBombNum</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</li><li class="src short"><a href="#v:coorBombExisNum">coorBombExisNum</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</li><li class="src short"><a href="#v:mapaMe">mapaMe</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:mapaTu">mapaTu</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:mapaTi">mapaTi</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:mapaTo">mapaTo</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</li><li class="src short"><a href="#v:main">main</a> :: IO ()</li></ul></div><div id="interface"><h1>Documentation</h1><div class="top"><p class="src"><a name="v:move" class="def">move</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>Caso n&#227;o seja poss&#237;vel aplicar o movimente quer por n&#227;o existir o jogador, ou o ponto para o qual pretende se deslocar seja uma pedra ou um tijolo ou o comando bomba seja aplicado a um jogador que n&#227;o tem PowerUps, &#233; devolvido o pr&#243;prio mapa. Se for executado o comando bomba &#233; chamada a fun&#231;&#227;o &quot;mapaMoveB&quot;. Caso o ponto para onde pretende ir o jogador coincida com um PowerUp devolve a &quot;mapaMove&quot; pela ordem contr&#225;ria. Nos restantes casos, devolve tamb&#233;m a &quot;mapaMove&quot; por ordem contr&#225;ria mais os restantes jogadores. </p></div></div><div class="top"><p class="src"><a name="v:veJogador" class="def">veJogador</a> :: [String] -&gt; Int -&gt; Char -&gt; Bool</p><div class="doc"><p>Esta fun&#231;&#227;o verifica se o jogador est&#225; em jogo. Para tal percorremos a lista, atrav&#233;s de uma recursiva, at&#233; encontrarmos a lista que cont&#233;m um algarismo. Caso o algarismo corresponda ao algarismo do jogador ao qual foi aplicado o movimento ent&#227;o a fun&#231;&#227;o devolve True. Caso contr&#225;rio a lista tornar-se-&#225; vazia e desover&#225; False.</p></div></div><div class="top"><p class="src"><a name="v:infJogador" class="def">infJogador</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>&quot;infJogador&quot; d&#225; a informa&#231;&#227;o relativa a um jogador. Para tal percorremos a lista, atrav&#233;s de uma recursiva, at&#233; encontrarmos a lista que cont&#233;m um algarismo. Caso o algarismo corresponda ao algarismo do jogador ao qual foi aplicado o movimento ent&#227;o &#233; devolvida a lista com a informa&#231;&#227;o do jogador. </p></div></div><div class="top"><p class="src"><a name="v:dim" class="def">dim</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</p><div class="doc"><p>Esta indica a dimens&#227;o do mapa recebido. Para tal calculamos o tamanho da cabe&#231;a da lista, que corresponde &#224; primeira linha do mapa constitu&#237;da apenas por pedras. </p></div></div><div class="top"><p class="src"><a name="v:coorJogNum" class="def">coorJogNum</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</p><div class="doc"><p>Indica o numero do mapa correspondente &#224; sua coordenada. Assim, multiplicamos o tamanho do mapa pela linha onde se encontra o jogador e somamos com a coluna mais um. </p></div></div><div class="top"><p class="src"><a name="v:pPonto" class="def">pPonto</a> :: [String] -&gt; Int -&gt; Char -&gt; Char</p><div class="doc"><p>&quot;pPonto&quot; &#233; o caracter associado &#224; posi&#231;&#227;o para a qual o jogador pretende ir.  </p></div></div><div class="top"><p class="src"><a name="v:preveMov" class="def">preveMov</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</p><div class="doc"><p>Esta d&#225; a posi&#231;&#227;o do mapa para qual o jogador pretende ir. Se o comando for <code>B</code> ent&#227;o a coordenada correspondente &#233; a mesma do jogador. Caso seja <code>R</code> o jogador movimenta-se para a direita logo a sua posi&#231;&#227;o ser&#225; o n&#250;mero atual do jogador menos um. O contr&#225;rio acontece quando o jogador se movimenta para a esquerda <code>L</code>. Se o jogador pretender ir para cima a sua posi&#231;&#227;o ser&#225; o seu n&#250;mero menos a dimens&#227;o do mapa. Quando pretende ir para baixo, &#233; o contr&#225;rio. </p></div></div><div class="top"><p class="src"><a name="v:coorNumJog" class="def">coorNumJog</a> :: [String] -&gt; Int -&gt; Char -&gt; [Char]</p><div class="doc"><p>A fun&#231;&#227;o d&#225; a lista com as novas coordenadas do jogador. O y &#233; dado pelo resto da divis&#227;o do n&#250;mero da posi&#231;&#227;o para a qual vai pela dimens&#227;o do mapa, menos um. O x &#233; obtido pela divis&#227;o inteira do n&#250;mero da posi&#231;&#227;o para a qual vai pela dimens&#227;o do mapa. </p></div></div><div class="top"><p class="src"><a name="v:mapaMove" class="def">mapaMove</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A &quot;mapaMove&quot; junta a altera&#231;&#227;o da informa&#231;&#227;o do jogador ao mapa. No caso da posi&#231;&#227;o para a qual o jogador vai corresponder a um PowerUp Bombs e se o jogador tiver PowerUps, ent&#227;o percorremos a lista at&#233; encontrarmos o n&#250;mero do jogador que se vai movimentar. Enquanto tal n&#227;o se verifica a fun&#231;&#227;o vai armazenando as listas eliminadas pela recursividade da fun&#231;&#227;o que n&#227;o cont&#233;m a lista do PowerUp apanhado pelo jogador, o que &#233; assegurado pela utiliza&#231;&#227;o da fun&#231;&#227;o &quot;mapaSPUb&quot;. Quando for encontrado junta o identificador do jogador com as coordenadas para qual vai e o restante da lista acrescentando o s&#237;mbolo de <code>+</code> mais o restante mapa sem a informa&#231;&#227;o antiga do jogador.      
Caso o jogador v&#225; para uma posi&#231;&#227;o na qual haja PowerUps e o jogador n&#227;o tenha PowerUps ent&#227;o recorremos ao mesmo m&#233;todo utilizado anteriormente com a diferen&#231;a de haver um espa&#231;o entre a coordenada x e o s&#237;mbolo de Bombs. O mesmo acontece no caso de o jogador se movimentar para o local onde houver PowerUps Flames apenas se diferen&#231;iando na medida em que o seu s&#237;mbolo &#233; <code>!</code>. Caso o jogador n&#227;o se movimente para um local onde haja PowerUps utilizamos uma recursiva at&#233; encontrarmos a lista com a informa&#231;&#227;o do jogador. De seguida alteramos esta informa&#231;&#227;o mundando apenas as suas coordenadas, juntando posteriormente ao resto da lista. </p></div></div><div class="top"><p class="src"><a name="v:coordNumPUB" class="def">coordNumPUB</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>Esta fun&#231;&#227;o devolve-nos uma lista com todos os Bombs descobertos no mapa. Percorremos a lista at&#233; encontrar-mos um Bombs, quando tal se sucede armazenamo-lo e verificamos se existem mais tarv&#233;s da recursiva. A fun&#231;&#227;o termina quando todos elementos foram verificados (lista vazia).</p></div></div><div class="top"><p class="src"><a name="v:coordNumPUF" class="def">coordNumPUF</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>Esta fun&#231;&#227;o devolve-nos uma lista com todos os Flames descobertos no mapa. Percorremos a lista at&#233; encontrar-mos um Flames, quando tal se sucede armazenamo-lo e verificamos se existem mais tarv&#233;s da recursiva. A fun&#231;&#227;o termina quando todos elementos foram verificados (lista vazia).</p></div></div><div class="top"><p class="src"><a name="v:coordNumPowerUpB" class="def">coordNumPowerUpB</a> :: [String] -&gt; Int -&gt; Char -&gt; [Int]</p><div class="doc"><p>A fun&#231;&#227;o d&#225; uma lista com os Bombs descobertos. Esta percorre todos os elementos da lista e aplica-lhes a fun&#231;&#227;o f, que multiplica o tamanho do mapa pela linha onde se encontra o Bombs e soma-lhe a coluna mais um.</p></div></div><div class="top"><p class="src"><a name="v:coordNumPowerUpF" class="def">coordNumPowerUpF</a> :: [String] -&gt; Int -&gt; Char -&gt; [Int]</p><div class="doc"><p>A fun&#231;&#227;o d&#225; uma lista com os Flames descobertos. Esta percorre todos os elementos da lista e aplica-lhes a fun&#231;&#227;o f, que multiplica o tamanho do mapa pela linha onde se encontra o Flames e soma-lhe a coluna mais um.</p></div></div><div class="top"><p class="src"><a name="v:mapaSPUb" class="def">mapaSPUb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A &quot;mapaSPUb&quot; devolve o estado do mapa inicial sem a informa&#231;&#227;o referente ao Bombs apanhado pelo jogador, recorrendo &#224; fun&#231;&#227;o pr&#233;-definida (\). </p></div></div><div class="top"><p class="src"><a name="v:mapaSPUf" class="def">mapaSPUf</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A &quot;mapaSPUf&quot; devolve o estado do mapa inicial sem a informa&#231;&#227;o referente ao Flame apanhado pelo jogador, recorrendo &#224; fun&#231;&#227;o pr&#233;-definida (\). </p></div></div><div class="top"><p class="src"><a name="v:existPU" class="def">existPU</a> :: [String] -&gt; Int -&gt; Char -&gt; Bool</p><div class="doc"><p>&quot;existPU&quot; verifica se o jogador tem powerUps para colocar bombas. </p></div></div><div class="top"><p class="src"><a name="v:existBomb" class="def">existBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; Bool</p><div class="doc"><p>Esta diz se existe bomba no mapa do estado de jogo inicial. Percorremos a lista, atrav&#233;s de uma recursiva, caso seja encontrado uma lista 
que cont&#233;m o s&#237;mbolo da bomba, &#233; porque existe caso contr&#225;rio a lista ficar&#225; vazia devolvendo False. </p></div></div><div class="top"><p class="src"><a name="v:infBomb" class="def">infBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>Esta fun&#231;&#227;o d&#225; a informa&#231;&#227;o da bomba proveniente do mapa do estado do jogo inicial. Para tal percorremos a lista, atrav&#233;s de uma recursiva,
at&#233; encontrarmos a lista que cont&#233;m o s&#237;mbolo da bomba (<code>*</code>). Quando tal se sucede &#233; devolvida esta lista. Para evitar problemas com a dimens&#227;o 
do mapa, invertemos a lista. </p></div></div><div class="top"><p class="src"><a name="v:infNovaBomb" class="def">infNovaBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A fun&#231;&#227;o indica a informa&#231;&#227;o da bomba que o jogador colocou. Esta &#233; constitu&#237;da com o s&#237;mbolo da bomba, a coordenada do jogador que a colocou
(dada pela fun&#231;&#227;o &quot;coorNumJog&quot;), o caracter coorrespondente ao jogador que a colocou, o raio de a&#231;&#227;o e tempo de explos&#227;o j&#225; definidos. Tivemos 
tamb&#233;m em conta de que se o jogador tiver um PowerUp Flame o raio da bomba ser&#225; 2. </p></div></div><div class="top"><p class="src"><a name="v:mapaMoveB" class="def">mapaMoveB</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>Esta fun&#231;&#227;o junta as bombas ordenadamente no mapa do estado inicial.Se o jogador pretender colocar uma bomba num local onde j&#225; existe entao &#233; lhe devolvido o mapa anterior. Nos restantes casos em que existe bomba, juntamos a &quot;mapaMe&quot; seguida das bombas ordenadas e da &quot;mapaTu&quot; por ordem contr&#225;ria.Caso contr&#225;rio unimos o &quot;mapaTi&quot; com a bomba nova e com o &quot;mapaTo&quot; por ordem contr&#225;rio.</p></div></div><div class="top"><p class="src"><a name="v:posBomb" class="def">posBomb</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A fun&#231;&#227;o ordena as bombas, ou seja, ordena a bomba proveniente do estado do mapa inicial e a bomba colocada pelo jogador. Caso n&#227;o haja 
bomba no estado do mapa inicial &#233; devolvida apenas a informa&#231;&#227;o da nova bomba. Sen&#227;o &#233; comparado o n&#250;mero associado &#224; bomba anterior com o 
n&#250;mero associado &#224; nova bomba. &#201; de notar que quando o jogador pretende colocar uma bomba onde j&#225; existe uma bomba &#233; devolvido o estado do 
mapa anterior.  </p></div></div><div class="top"><p class="src"><a name="v:coorBombNum" class="def">coorBombNum</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</p><div class="doc"><p>A fun&#231;&#227;o indica o n&#250;mero do mapa da bomba colocada que o jogador quer colocar. Assim, multiplicamos o tamanho de mapa pela linha onde se encontra a bomba que vai 
ser colocada e somamos com a coluna mais um. </p></div></div><div class="top"><p class="src"><a name="v:coorBombExisNum" class="def">coorBombExisNum</a> :: [String] -&gt; Int -&gt; Char -&gt; Int</p><div class="doc"><p>A fun&#231;&#227;o indica o n&#250;mero do mapa da bomba proveniente do estado inicial. Assim, multiplicamos o tamanho de mapa pela linha onde se encontra a bomba e somamos 
com a coluna mais um. </p></div></div><div class="top"><p class="src"><a name="v:mapaMe" class="def">mapaMe</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A &quot;mapaMe&quot; percorre a lista e guarda a informa&#231;&#227;o at&#233; encontrar a informa&#231;&#227;o da bomba (&quot;infBomb&quot;). </p></div></div><div class="top"><p class="src"><a name="v:mapaTu" class="def">mapaTu</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>Esta fun&#231;&#227;o percorre todos os elementos da lista, no entanto inverte-a, para armazenar a informa&#231;&#227;o posterior &#224; bomba. </p></div></div><div class="top"><p class="src"><a name="v:mapaTi" class="def">mapaTi</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A &quot;mapaTi&quot; percorre a lista e guarda a informa&#231;&#227;o at&#233; encontrar um algarismo, fornecendo um mapa sem informa&#231;&#245;es dos jogadores.</p></div></div><div class="top"><p class="src"><a name="v:mapaTo" class="def">mapaTo</a> :: [String] -&gt; Int -&gt; Char -&gt; [String]</p><div class="doc"><p>A fun&#231;&#227;o percorre todos os elementos da lista, no entanto inverte-a, para armazenar a informa&#231;&#227;o dos jogadores.</p></div></div><div class="top"><p class="src"><a name="v:main" class="def">main</a> :: IO ()</p></div></div></div><div id="footer"><p>Produced by <a href="http://www.haskell.org/haddock/">Haddock</a> version 2.16.1</p></div></body></html>